# Исходный массив:
# [1, 2, 3, 4, 5]
# Массив в обратном порядке:
# [5, 4, 3, 2, 1]
# Исходный массив (не изменился):
# [1, 2, 3, 4, 5]
# Исходный массив (после изменения):
# [5, 4, 3, 2, 1]

# Заводимо масив
array1 = [1, 2, 3, 4, 5]
puts 'Поточний масив'
puts array1.to_s

# Масив в зворотньому порядку
puts 'Масив в зворотньому порядку'
puts array1.reverse.to_s

# Масив в зворотньому порядку
puts 'Масив в зворотньому порядку змінений '
puts array1.to_s

# Масив в зворотньому порядку
puts 'Масив в зворотньому порядку змінений '
puts array1.reverse!.to_s